In [1]:
import pandas as pd
import sqlite3

In [2]:
db = sqlite3.connect('IMDB.sqlite')

In [7]:
# df_IMDB = pd.read_sql_query('Select * from IMDB',db)
df_Genre = pd.read_sql_query('Select * from genre',db)
# df_Earn = pd.read_sql_query('Select * from earning',db)

In [9]:
df_Genre.head(2)

  Movie_id      genre
0    36809  Biography
1    30114  Adventure

IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.

Find the count of each genre present in IMDB movie dataset?

Print the Genre and number of movies present in that genre.

Note: Ignore the empty value present in genre.

In [57]:
df_Genre = df_Genre[df_Genre['genre'] != '']

In [58]:
df_Genre = df_Genre["genre"].value_counts()

In [59]:
for i in range(0,len(df_Genre)):
    if df_Genre.index[0] == "":
        continue
    print(df_Genre.index[i],df_Genre.values[i])

Drama 77
Adventure 43
Action 33
Comedy 31
Biography 21
Sci-Fi 18
Thriller 14
Animation 13
Romance 13
Crime 11
Mystery 7
Fantasy 7
History 6
Family 3
Sport 3
Music 3
Western 2
War 2
Horror 2
Musical 1

IMDB.sqlite' database contains all details of movies and has three tables with name IMDB, genre and earning.

Find the highest-grossing movie (i.e domestic earning + worldwide earning) in IMDB database.

Print the rating of that movie.

In [64]:
df_Earn.head(5)

  Movie_id  Domestic    Worldwide
0    36809  56671993  187733202.0
1    30114  18335230   60738797.0
2    37367  35014192   39187783.0
3    49473  15322921   87100449.0
4    14867   6739492   19839492.0

In [65]:
df = pd.read_sql_query('select * from earning inner join IMDB on earning.Movie_id = IMDB.Movie_id',db)

In [67]:
df['Total'] = df['Domestic'] + df['Worldwide']

In [68]:
df['Total']

0      2.444052e+08
1      7.907403e+07
2      7.420198e+07
3      1.024234e+08
4      2.657898e+07
           ...
112    6.207404e+07
113    6.606458e+08
114    9.817843e+08
115    5.000324e+08
116    1.365052e+09
Name: Total, Length: 117, dtype: float64

In [78]:
max1 = max(df['Total'])
max1
row = df[df['Total'] == max1]
print(row.values[0][5])

8.1